codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efm124.h
#define _ADCSYSCFG1_AN45_POSITION                0x0000000D
#define _ADCSYSCFG1_AN45_MASK                    0x00002000
#define _ADCSYSCFG1_AN45_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN46_POSITION                0x0000000E
#define _ADCSYSCFG1_AN46_MASK                    0x00004000
#define _ADCSYSCFG1_AN46_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN47_POSITION                0x0000000F
#define _ADCSYSCFG1_AN47_MASK                    0x00008000
#define _ADCSYSCFG1_AN47_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN48_POSITION                0x00000010
#define _ADCSYSCFG1_AN48_MASK                    0x00010000
#define _ADCSYSCFG1_AN48_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN49_POSITION                0x00000011
#define _ADCSYSCFG1_AN49_MASK                    0x00020000
#define _ADCSYSCFG1_AN49_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN50_POSITION                0x00000012
#define _ADCSYSCFG1_AN50_MASK                    0x00040000
#define _ADCSYSCFG1_AN50_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN51_POSITION                0x00000013
#define _ADCSYSCFG1_AN51_MASK                    0x00080000
#define _ADCSYSCFG1_AN51_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN52_POSITION                0x00000014
#define _ADCSYSCFG1_AN52_MASK                    0x00100000
#define _ADCSYSCFG1_AN52_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN53_POSITION                0x00000015
#define _ADCSYSCFG1_AN53_MASK                    0x00200000
#define _ADCSYSCFG1_AN53_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN54_POSITION                0x00000016
#define _ADCSYSCFG1_AN54_MASK                    0x00400000
#define _ADCSYSCFG1_AN54_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN55_POSITION                0x00000017
#define _ADCSYSCFG1_AN55_MASK                    0x00800000
#define _ADCSYSCFG1_AN55_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN56_POSITION                0x00000018
#define _ADCSYSCFG1_AN56_MASK                    0x01000000
#define _ADCSYSCFG1_AN56_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN57_POSITION                0x00000019
#define _ADCSYSCFG1_AN57_MASK                    0x02000000
#define _ADCSYSCFG1_AN57_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN58_POSITION                0x0000001A
#define _ADCSYSCFG1_AN58_MASK                    0x04000000
#define _ADCSYSCFG1_AN58_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN59_POSITION                0x0000001B
#define _ADCSYSCFG1_AN59_MASK                    0x08000000
#define _ADCSYSCFG1_AN59_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN60_POSITION                0x0000001C
#define _ADCSYSCFG1_AN60_MASK                    0x10000000
#define _ADCSYSCFG1_AN60_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN61_POSITION                0x0000001D
#define _ADCSYSCFG1_AN61_MASK                    0x20000000
#define _ADCSYSCFG1_AN61_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN62_POSITION                0x0000001E
#define _ADCSYSCFG1_AN62_MASK                    0x40000000
#define _ADCSYSCFG1_AN62_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN63_POSITION                0x0000001F
#define _ADCSYSCFG1_AN63_MASK                    0x80000000
#define _ADCSYSCFG1_AN63_LENGTH                  0x00000001

#define _ADCDATA0_DATA_POSITION                  0x00000000
#define _ADCDATA0_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA0_DATA_LENGTH                    0x00000020

#define _ADCDATA1_DATA_POSITION                  0x00000000
#define _ADCDATA1_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA1_DATA_LENGTH                    0x00000020

#define _ADCDATA2_DATA_POSITION                  0x00000000
#define _ADCDATA2_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA2_DATA_LENGTH                    0x00000020

#define _ADCDATA3_DATA_POSITION                  0x00000000
#define _ADCDATA3_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA3_DATA_LENGTH                    0x00000020

#define _ADCDATA4_DATA_POSITION                  0x00000000
#define _ADCDATA4_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA4_DATA_LENGTH                    0x00000020

#define _ADCDATA5_DATA_POSITION                  0x00000000
#define _ADCDATA5_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA5_DATA_LENGTH                    0x00000020

#define _ADCDATA6_DATA_POSITION                  0x00000000
#define _ADCDATA6_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA6_DATA_LENGTH                    0x00000020

#define _ADCDATA7_DATA_POSITION                  0x00000000
#define _ADCDATA7_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA7_DATA_LENGTH                    0x00000020

#define _ADCDATA8_DATA_POSITION                  0x00000000
#define _ADCDATA8_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA8_DATA_LENGTH                    0x00000020

#define _ADCDATA9_DATA_POSITION                  0x00000000
#define _ADCDATA9_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA9_DATA_LENGTH                    0x00000020

#define _ADCDATA10_DATA_POSITION                 0x00000000
#define _ADCDATA10_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA10_DATA_LENGTH                   0x00000020

#define _ADCDATA11_DATA_POSITION                 0x00000000
#define _ADCDATA11_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA11_DATA_LENGTH                   0x00000020

#define _ADCDATA12_DATA_POSITION                 0x00000000
#define _ADCDATA12_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA12_DATA_LENGTH                   0x00000020

#define _ADCDATA13_DATA_POSITION                 0x00000000
#define _ADCDATA13_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA13_DATA_LENGTH                   0x00000020

#define _ADCDATA14_DATA_POSITION                 0x00000000
#define _ADCDATA14_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA14_DATA_LENGTH                   0x00000020

#define _ADCDATA15_DATA_POSITION                 0x00000000
#define _ADCDATA15_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA15_DATA_LENGTH                   0x00000020

