codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efm124.h
#define _SQI1CFG_LSBF_POSITION                   0x00000005
#define _SQI1CFG_LSBF_MASK                       0x00000020
#define _SQI1CFG_LSBF_LENGTH                     0x00000001

#define _SQI1CFG_WP_POSITION                     0x00000009
#define _SQI1CFG_WP_MASK                         0x00000200
#define _SQI1CFG_WP_LENGTH                       0x00000001

#define _SQI1CFG_HOLD_POSITION                   0x0000000A
#define _SQI1CFG_HOLD_MASK                       0x00000400
#define _SQI1CFG_HOLD_LENGTH                     0x00000001

#define _SQI1CFG_BURSTEN_POSITION                0x0000000C
#define _SQI1CFG_BURSTEN_MASK                    0x00001000
#define _SQI1CFG_BURSTEN_LENGTH                  0x00000001

#define _SQI1CFG_RESET_POSITION                  0x00000010
#define _SQI1CFG_RESET_MASK                      0x00010000
#define _SQI1CFG_RESET_LENGTH                    0x00000001

#define _SQI1CFG_TXBUFRST_POSITION               0x00000011
#define _SQI1CFG_TXBUFRST_MASK                   0x00020000
#define _SQI1CFG_TXBUFRST_LENGTH                 0x00000001

#define _SQI1CFG_RXBUFRST_POSITION               0x00000012
#define _SQI1CFG_RXBUFRST_MASK                   0x00040000
#define _SQI1CFG_RXBUFRST_LENGTH                 0x00000001

#define _SQI1CFG_CONBUFRST_POSITION              0x00000013
#define _SQI1CFG_CONBUFRST_MASK                  0x00080000
#define _SQI1CFG_CONBUFRST_LENGTH                0x00000001

#define _SQI1CFG_DATAEN_POSITION                 0x00000014
#define _SQI1CFG_DATAEN_MASK                     0x00300000
#define _SQI1CFG_DATAEN_LENGTH                   0x00000002

#define _SQI1CFG_SQIEN_POSITION                  0x00000017
#define _SQI1CFG_SQIEN_MASK                      0x00800000
#define _SQI1CFG_SQIEN_LENGTH                    0x00000001

#define _SQI1CFG_CSEN_POSITION                   0x00000018
#define _SQI1CFG_CSEN_MASK                       0x03000000
#define _SQI1CFG_CSEN_LENGTH                     0x00000002

#define _SQI1CON_TXRXCOUNT_POSITION              0x00000000
#define _SQI1CON_TXRXCOUNT_MASK                  0x0000FFFF
#define _SQI1CON_TXRXCOUNT_LENGTH                0x00000010

#define _SQI1CON_CMDINIT_POSITION                0x00000010
#define _SQI1CON_CMDINIT_MASK                    0x00030000
#define _SQI1CON_CMDINIT_LENGTH                  0x00000002

#define _SQI1CON_LANEMODE_POSITION               0x00000012
#define _SQI1CON_LANEMODE_MASK                   0x000C0000
#define _SQI1CON_LANEMODE_LENGTH                 0x00000002

#define _SQI1CON_DEVSEL_POSITION                 0x00000014
#define _SQI1CON_DEVSEL_MASK                     0x00300000
#define _SQI1CON_DEVSEL_LENGTH                   0x00000002

#define _SQI1CON_DASSERT_POSITION                0x00000016
#define _SQI1CON_DASSERT_MASK                    0x00400000
#define _SQI1CON_DASSERT_LENGTH                  0x00000001

#define _SQI1CON_DDRMODE_POSITION                0x00000017
#define _SQI1CON_DDRMODE_MASK                    0x00800000
#define _SQI1CON_DDRMODE_LENGTH                  0x00000001

#define _SQI1CON_SCHECK_POSITION                 0x00000018
#define _SQI1CON_SCHECK_MASK                     0x01000000
#define _SQI1CON_SCHECK_LENGTH                   0x00000001

#define _SQI1CLKCON_EN_POSITION                  0x00000000
#define _SQI1CLKCON_EN_MASK                      0x00000001
#define _SQI1CLKCON_EN_LENGTH                    0x00000001

#define _SQI1CLKCON_STABLE_POSITION              0x00000001
#define _SQI1CLKCON_STABLE_MASK                  0x00000002
#define _SQI1CLKCON_STABLE_LENGTH                0x00000001

#define _SQI1CLKCON_CLKDIV_POSITION              0x00000008
#define _SQI1CLKCON_CLKDIV_MASK                  0x0007FF00
#define _SQI1CLKCON_CLKDIV_LENGTH                0x0000000B

#define _SQI1CMDTHR_RXCMDTHR_POSITION            0x00000000
#define _SQI1CMDTHR_RXCMDTHR_MASK                0x0000003F
#define _SQI1CMDTHR_RXCMDTHR_LENGTH              0x00000006

#define _SQI1CMDTHR_TXCMDTHR_POSITION            0x00000008
#define _SQI1CMDTHR_TXCMDTHR_MASK                0x00003F00
#define _SQI1CMDTHR_TXCMDTHR_LENGTH              0x00000006

#define _SQI1INTTHR_RXINTTHR_POSITION            0x00000000
#define _SQI1INTTHR_RXINTTHR_MASK                0x0000003F
#define _SQI1INTTHR_RXINTTHR_LENGTH              0x00000006

#define _SQI1INTTHR_TXINTTHR_POSITION            0x00000008
#define _SQI1INTTHR_TXINTTHR_MASK                0x00003F00
#define _SQI1INTTHR_TXINTTHR_LENGTH              0x00000006

#define _SQI1INTEN_TXEMPTYIE_POSITION            0x00000000
#define _SQI1INTEN_TXEMPTYIE_MASK                0x00000001
#define _SQI1INTEN_TXEMPTYIE_LENGTH              0x00000001

#define _SQI1INTEN_TXFULLIE_POSITION             0x00000001
#define _SQI1INTEN_TXFULLIE_MASK                 0x00000002
#define _SQI1INTEN_TXFULLIE_LENGTH               0x00000001

#define _SQI1INTEN_TXTHRIE_POSITION              0x00000002
#define _SQI1INTEN_TXTHRIE_MASK                  0x00000004
#define _SQI1INTEN_TXTHRIE_LENGTH                0x00000001

#define _SQI1INTEN_RXEMPTYIE_POSITION            0x00000003
#define _SQI1INTEN_RXEMPTYIE_MASK                0x00000008
#define _SQI1INTEN_RXEMPTYIE_LENGTH              0x00000001

#define _SQI1INTEN_RXFULLIE_POSITION             0x00000004
#define _SQI1INTEN_RXFULLIE_MASK                 0x00000010
#define _SQI1INTEN_RXFULLIE_LENGTH               0x00000001

#define _SQI1INTEN_RXTHRIE_POSITION              0x00000005
#define _SQI1INTEN_RXTHRIE_MASK                  0x00000020
#define _SQI1INTEN_RXTHRIE_LENGTH                0x00000001

#define _SQI1INTEN_CONFULLIE_POSITION            0x00000006
#define _SQI1INTEN_CONFULLIE_MASK                0x00000040
#define _SQI1INTEN_CONFULLIE_LENGTH              0x00000001

#define _SQI1INTEN_CONEMPTYIE_POSITION           0x00000007
#define _SQI1INTEN_CONEMPTYIE_MASK               0x00000080
#define _SQI1INTEN_CONEMPTYIE_LENGTH             0x00000001

#define _SQI1INTEN_CONTHRIE_POSITION             0x00000008
#define _SQI1INTEN_CONTHRIE_MASK                 0x00000100
#define _SQI1INTEN_CONTHRIE_LENGTH               0x00000001

#define _SQI1INTEN_BDDONEIE_POSITION             0x00000009
#define _SQI1INTEN_BDDONEIE_MASK                 0x00000200
#define _SQI1INTEN_BDDONEIE_LENGTH               0x00000001

#define _SQI1INTEN_PKTCOMPIE_POSITION            0x0000000A
#define _SQI1INTEN_PKTCOMPIE_MASK                0x00000400
#define _SQI1INTEN_PKTCOMPIE_LENGTH              0x00000001

